# Task 2

## Task 1: Create DataFrame

In [204]:
import pandas as pd 
grades_dict = {'Wally': [67, 78, 92], 'Eva': [99, 87, 92], 'Sam': [67, 72, 70], 'Katie': [34, 82, 89], 'Bob': [77, 76, 72]}
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     67   99   67     34   77
1     78   87   72     82   76
2     92   92   70     89   72

## Task 2: Custom Index

In [205]:
grades.index = ['Test1', 'Test2', 'Test3']
grades

       Wally  Eva  Sam  Katie  Bob
Test1     67   99   67     34   77
Test2     78   87   72     82   76
Test3     92   92   70     89   72

In [206]:
grades_dict['Eva']

[99, 87, 92]

In [207]:
grades.Sam

Test1    67
Test2    72
Test3    70
Name: Sam, dtype: int64

## Task 3: Accessing Rows (loc, iloc)

In [208]:
grades.loc['Test1']

Wally    67
Eva      99
Sam      67
Katie    34
Bob      77
Name: Test1, dtype: int64

I think I prefer loc. It seems like it would be easier to use with large sets of data. It's easier for me to think of the name of the row that I want to view as opposed to the number of the row.

In [209]:
grades.iloc[0]

Wally    67
Eva      99
Sam      67
Katie    34
Bob      77
Name: Test1, dtype: int64

In [210]:
grades.loc[['Test1', 'Test3']]

       Wally  Eva  Sam  Katie  Bob
Test1     67   99   67     34   77
Test3     92   92   70     89   72

## Task 3: Accessing Subsets (at, iat)

In [211]:
grades.at['Test2', 'Eva']

87

In [212]:
grades.iat[2, 0]

92

## Task 4: Describe (By Column)

In [213]:
grades.describe()

       Wally    Eva    Sam  Katie    Bob
count   3.00   3.00   3.00   3.00   3.00
mean   79.00  92.67  69.67  68.33  75.00
std    12.53   6.03   2.52  29.94   2.65
min    67.00  87.00  67.00  34.00  72.00
25%    72.50  89.50  68.50  58.00  74.00
50%    78.00  92.00  70.00  82.00  76.00
75%    85.00  95.50  71.00  85.50  76.50
max    92.00  99.00  72.00  89.00  77.00

In [214]:
pd.set_option("display.precision",2)

I got an error message of "Pattern matched multiple keys". A google search led me to pandas.pydata.org, which showed the same error message in an example

## Task 5: Transpose (rows <--> columns)

In [215]:
grades.mean()

Wally    79.00
Eva      92.67
Sam      69.67
Katie    68.33
Bob      75.00
dtype: float64

In [216]:
grades.T

       Test1  Test2  Test3
Wally     67     78     92
Eva       99     87     92
Sam       67     72     70
Katie     34     82     89
Bob       77     76     72

In [217]:
grades.T.describe()

       Test1  Test2  Test3
count   5.00   5.00   5.00
mean   68.80  79.00  83.00
std    23.44   5.74  11.05
min    34.00  72.00  70.00
25%    67.00  76.00  72.00
50%    67.00  78.00  89.00
75%    77.00  82.00  92.00
max    99.00  87.00  92.00